marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
    /* PCS Divider End Register 1 Address. */
    #define MC_CGM_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 Address. */
    #define MC_CGM_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x070CU))

    /* PCS Divider Change Register 2 Address. */
    #define MC_CGM_PCS_DIVC2_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0710U))

    /* PCS Divider End Register 2 Address. */
    #define MC_CGM_PCS_DIVE2_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0714U))
    /* PCS Divider Start Register 2 Address. */
    #define MC_CGM_PCS_DIVS2_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0718U))

#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00 ))
    /* PCS Divider Change Register 3 Address. */
    #define MC_CGM_PCS_DIVC3_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x071CU))

    /* PCS Divider End Register 3 Address. */
    #define MC_CGM_PCS_DIVE3_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0720U))
    /* PCS Divider Start Register 3 Address. */
    #define MC_CGM_PCS_DIVS3_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0724U))

#endif /* (IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00 ) */

    /* PCS Divider Change Register 4 Address. */
    #define MC_CGM_PCS_DIVC4_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0728U))

    /* PCS Divider End Register 4 Address. */
    #define MC_CGM_PCS_DIVE4_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x072CU))
    /* PCS Divider Start Register 4 Address. */
    #define MC_CGM_PCS_DIVS4_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0730U))

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* PCS Switch Duration Register (MC_CGM_PCS_SDUR) */
    #define MC_CGM_PCS_SDUR_ADDR8           ((uint32)(MC_CGM_BASEADDR + (uint32)0x0703U))

    /* PCS Divider Change Register 1 (MC_CGM_PCS_DIVC1) */
    #define MC_CGM_PCS_DIVC1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0704U))
    /* PCS Divider End Register 1 (MC_CGM_PCS_DIVE1) */
    #define MC_CGM_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 (MC_CGM_PCS_DIVS1) */
    #define MC_CGM_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x070CU))

    /* PCS Divider Change Register 4 (MC_CGM_PCS_DIVC4) */
    #define MC_CGM_PCS_DIVC4_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0728U))
    /* PCS Divider End Register 4 (MC_CGM_PCS_DIVE4) */
    #define MC_CGM_PCS_DIVE4_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x072CU))
    /* PCS Divider Start Register 4 (MC_CGM_PCS_DIVS4) */
    #define MC_CGM_PCS_DIVS4_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0730U))

    /* PCS Divider Change Register 5 (MC_CGM_PCS_DIVC5) */
    #define MC_CGM_PCS_DIVC5_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0734U))
    /* PCS Divider End Register 5 (MC_CGM_PCS_DIVE5) */
    #define MC_CGM_PCS_DIVE5_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0738U))
    /* PCS Divider Start Register 5 (MC_CGM_PCS_DIVS5) */
    #define MC_CGM_PCS_DIVS5_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x073CU))

 #elif (IPV_MC == IPV_MC_05_00_00_07)

     /* PCS Switch Duration Register (MC_CGM_PCS_SDUR) */
    #define MC_CGM_PCS_SDUR_ADDR8           ((uint32)(MC_CGM_BASEADDR + (uint32)0x0700U))
    /* PCS Divider Change Register 1 Address. */
    #define MC_CGM_PCS_DIVC1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0704U))
    /* PCS Divider End Register 1 Address. */
    #define MC_CGM_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 Address. */
    #define MC_CGM_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x070CU))
    /* PCS Divider Change Register 2 Address. */
    #define MC_CGM_PCS_DIVC2_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0710U))
    /* PCS Divider End Register 2 Address. */
    #define MC_CGM_PCS_DIVE2_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0714U))
    /* PCS Divider Start Register 2 Address. */
    #define MC_CGM_PCS_DIVS2_ADDR32         ((uint32)(MC_CGM_BASEADDR + (uint32)0x0718U))

#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* PCS Switch Duration Register (MC_CGM_PCS_SDUR) */
    #define MC_CGM_0_PCS_SDUR_ADDR8           ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0700U))
    /* PCS Divider Change Register 1 Address. */
    #define MC_CGM_0_PCS_DIVC1_ADDR32         ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0704U))
    /* PCS Divider End Register 1 Address. */
    #define MC_CGM_0_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 Address. */
    #define MC_CGM_0_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x070CU))
    /* PCS Divider Change Register 2 Address. */
    #define MC_CGM_0_PCS_DIVC2_ADDR32         ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0710U))
    /* PCS Divider End Register 2 Address. */
    #define MC_CGM_0_PCS_DIVE2_ADDR32         ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0714U))
    /* PCS Divider Start Register 2 Address. */
    #define MC_CGM_0_PCS_DIVS2_ADDR32         ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0718U))
    
    /* PCS Switch Duration Register (MC_CGM_PCS_SDUR) */
    #define MC_CGM_1_PCS_SDUR_ADDR8           ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x0700U))
    /* PCS Divider Change Register 1 Address. */
    #define MC_CGM_1_PCS_DIVC1_ADDR32         ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x0704U))
    /* PCS Divider End Register 1 Address. */
    #define MC_CGM_1_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 Address. */
    #define MC_CGM_1_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x070CU))
    /* PCS Divider Change Register 2 Address. */
    #define MC_CGM_1_PCS_DIVC2_ADDR32         ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x0710U))
    /* PCS Divider End Register 2 Address. */
    #define MC_CGM_1_PCS_DIVE2_ADDR32         ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x0714U))
    /* PCS Divider Start Register 2 Address. */
    #define MC_CGM_1_PCS_DIVS2_ADDR32         ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x0718U))

    /* PCS Switch Duration Register (MC_CGM_PCS_SDUR) */
    #define MC_CGM_2_PCS_SDUR_ADDR8           ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0700U))
    /* PCS Divider Change Register 1 Address. */
    #define MC_CGM_2_PCS_DIVC1_ADDR32         ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0704U))
    /* PCS Divider End Register 1 Address. */
    #define MC_CGM_2_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 Address. */
    #define MC_CGM_2_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x070CU))
    /* PCS Divider Change Register 2 Address. */
    #define MC_CGM_2_PCS_DIVC2_ADDR32         ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0710U))
    /* PCS Divider End Register 2 Address. */
    #define MC_CGM_2_PCS_DIVE2_ADDR32         ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0714U))
    /* PCS Divider Start Register 2 Address. */
    #define MC_CGM_2_PCS_DIVS2_ADDR32         ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0718U))
    
    /* PCS Switch Duration Register (MC_CGM_PCS_SDUR) */
    #define MC_CGM_3_PCS_SDUR_ADDR8           ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x0700U))
    /* PCS Divider Change Register 1 Address. */
    #define MC_CGM_3_PCS_DIVC1_ADDR32         ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x0704U))
    /* PCS Divider End Register 1 Address. */
    #define MC_CGM_3_PCS_DIVE1_ADDR32         ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x0708U))
    /* PCS Divider Start Register 1 Address. */
    #define MC_CGM_3_PCS_DIVS1_ADDR32         ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x070CU))
    /* PCS Divider Change Register 2 Address. */
    #define MC_CGM_3_PCS_DIVC2_ADDR32         ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x0710U))
    /* PCS Divider End Register 2 Address. */
    #define MC_CGM_3_PCS_DIVE2_ADDR32         ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x0714U))
    /* PCS Divider Start Register 2 Address. */
    #define MC_CGM_3_PCS_DIVS2_ADDR32         ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x0718U))
#endif


