marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/********************    MC_CGM_UPD     ********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_00_15_15) ||\
     (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_05_00_00_10) ||\
     (IPV_MC == IPV_MC_05_00_00_07) || (IPV_MC == IPV_MC_04_06_05_00) \
    )

    /* System Clock Divider Ratio Change Register (MC_CGM_SC_DIV_RC) */
    #define MC_CGM_SC_DIV_RC_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x07D0U))
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    #define MC_CGM_DIV_UPD_TYPE_ADDR32              ((uint32)(MC_CGM_BASEADDR + (uint32)0x07D4U))
    /* Divider Update Trigger (MC_CGM_DIV_UPD_TRIG) */
    #define MC_CGM_DIV_UPD_TRIG_ADDR32              ((uint32)(MC_CGM_BASEADDR + (uint32)0x07D8U))
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    #define MC_CGM_DIV_UPD_STAT_ADDR32              ((uint32)(MC_CGM_BASEADDR + (uint32)0x07DCU))

#endif /* ((IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_00_15_15) ||
           (IPV_MC == IPV_MC_04_01_00_00)) */

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* System Clock Divider Ratio Change Register (MC_CGM_SC_DIV_RC) */
    #define MC_CGM_0_SC_DIV_RC_ADDR32                 ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07D0U))
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    #define MC_CGM_0_DIV_UPD_TYPE_ADDR32              ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07D4U))
    /* Divider Update Trigger (MC_CGM_DIV_UPD_TRIG) */
    #define MC_CGM_0_DIV_UPD_TRIG_ADDR32              ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07D8U))
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    #define MC_CGM_0_DIV_UPD_STAT_ADDR32              ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07DCU))
    
    /* System Clock Divider Ratio Change Register (MC_CGM_SC_DIV_RC) */
    #define MC_CGM_1_SC_DIV_RC_ADDR32                 ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07D0U))
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    #define MC_CGM_1_DIV_UPD_TYPE_ADDR32              ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07D4U))
    /* Divider Update Trigger (MC_CGM_DIV_UPD_TRIG) */
    #define MC_CGM_1_DIV_UPD_TRIG_ADDR32              ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07D8U))
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    #define MC_CGM_1_DIV_UPD_STAT_ADDR32              ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07DCU))
    
    /* System Clock Divider Ratio Change Register (MC_CGM_SC_DIV_RC) */
    #define MC_CGM_2_SC_DIV_RC_ADDR32                 ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x07D0U))
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    #define MC_CGM_2_DIV_UPD_TYPE_ADDR32              ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x07D4U))
    /* Divider Update Trigger (MC_CGM_DIV_UPD_TRIG) */
    #define MC_CGM_2_DIV_UPD_TRIG_ADDR32              ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x07D8U))
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    #define MC_CGM_2_DIV_UPD_STAT_ADDR32              ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x07DCU))
    
    /* System Clock Divider Ratio Change Register (MC_CGM_SC_DIV_RC) */
    #define MC_CGM_3_SC_DIV_RC_ADDR32                 ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07D0U))
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    #define MC_CGM_3_DIV_UPD_TYPE_ADDR32              ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07D4U))
    /* Divider Update Trigger (MC_CGM_DIV_UPD_TRIG) */
    #define MC_CGM_3_DIV_UPD_TRIG_ADDR32              ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07D8U))
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    #define MC_CGM_3_DIV_UPD_STAT_ADDR32              ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07DCU))
#endif

/***********************************************************/
/**********************    CGM_SC     **********************/
/***********************************************************/
/* CGM: System Clock Select Status Register Address. */
#define MC_CGM_SC_SS_ADDR32                     ((uint32)(MC_CGM_BASEADDR + (uint32)0x07E4U))

/* CGM: System Clock Divider 0 Configuration Registers Address. */
#define MC_CGM_SC_DC0_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x07E8U))
/* CGM: System Clock Divider 1 Configuration Registers Address. */
#define MC_CGM_SC_DC1_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x07ECU))
/* CGM: System Clock Divider 2 Configuration Registers Address. */
#define MC_CGM_SC_DC2_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x07F0U))
/* CGM: System Clock Divider 3 Configuration Registers Address. */
#define MC_CGM_SC_DC3_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x07F4U))
/* CGM: System Clock Divider 4 Configuration Registers Address. */
#define MC_CGM_SC_DC4_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x07F8U))
/* CGM: System Clock Divider 5 Configuration Register Address. */
#define MC_CGM_SC_DC5_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x07FCU))

#if (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM: System Clock Divider 6 Configuration Register Address. */
    #define MC_CGM_SC_DC6_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0200U))
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_SC_DC6_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0400U))
#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: System Clock Select Status Register Address. */
    #define MC_CGM_0_SC_SS_ADDR32                     ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07E4U))
    /* CGM: System Clock Divider 0 Configuration Registers Address. */
    #define MC_CGM_0_SC_DC0_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07E8U))
    /* CGM: System Clock Divider 1 Configuration Registers Address. */
    #define MC_CGM_0_SC_DC1_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07ECU))
    /* CGM: System Clock Divider 2 Configuration Registers Address. */
    #define MC_CGM_0_SC_DC2_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x07F0U))
    
    /* CGM: System Clock Select Status Register Address. */
    #define MC_CGM_1_SC_SS_ADDR32                     ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07E4U))
    /* CGM: System Clock Divider 0 Configuration Registers Address. */
    #define MC_CGM_1_SC_DC0_ADDR32                    ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07E8U))
    /* CGM: System Clock Divider 1 Configuration Registers Address. */
    #define MC_CGM_1_SC_DC1_ADDR32                    ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07ECU))
    /* CGM: System Clock Divider 2 Configuration Registers Address. */
    #define MC_CGM_1_SC_DC2_ADDR32                    ((uint32)(MC_CGM_1_BASEADDR + (uint32)0x07F0U))
    
    /* CGM: System Clock Select Status Register Address. */
    #define MC_CGM_2_SC_SS_ADDR32                     ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x07E4U))
    /* CGM: System Clock Divider 0 Configuration Registers Address. */
    #define MC_CGM_2_SC_DC0_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x07E8U))
    
    /* CGM: System Clock Select Status Register Address. */
    #define MC_CGM_3_SC_SS_ADDR32                     ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07E4U))
    /* CGM: System Clock Divider 0 Configuration Registers Address. */
    #define MC_CGM_3_SC_DC0_ADDR32                    ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07E8U))
    /* CGM: System Clock Divider 1 Configuration Registers Address. */
    #define MC_CGM_3_SC_DC1_ADDR32                    ((uint32)(MC_CGM_3_BASEADDR + (uint32)0x07ECU))
#endif

