marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
#if (IPV_MC == IPV_MC_06_00_00_10)
    #define SRC_GPR1_ADDR32                           ((uint32)(SRC_BASEADDR + (uint32)0x0100U))
#endif


/***********************************************************/
/**********************  CGM_CLKOUT1  **********************/
/***********************************************************/
/* CGM: Clkout 1 Select Register Address */
#define MC_CGM_CLKOUT1_SC_ADDR32               ((uint32)(MC_CGM_BASEADDR + (uint32)0x0180U))

/* CLKOUT1_DC Configuration Register Address */
#define MC_CGM_CLKOUT1_DC_ADDR32               ((uint32)(MC_CGM_BASEADDR + (uint32)0x0188U))

/***********************************************************/
/**********************    CGM_AC0    **********************/
/***********************************************************/
#define MC_CGM_AC0_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0800U))

/* CGM: Auxiliary Clock 0 Select Status Register Address. */
#define MC_CGM_AC0_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0804U))

/* CGM: Auxiliary Clock 0 Divider Configuration Register 0 Address. */
#define MC_CGM_AC0_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0808U))
/* CGM: Auxiliary Clock 0 Divider Configuration Register 1 Address. */
#define MC_CGM_AC0_DC1_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x080CU))
/* CGM: Auxiliary Clock 0 Divider Configuration Register 2 Address. */
#define MC_CGM_AC0_DC2_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0810U))
/* CGM: Auxiliary Clock 0 Divider Configuration Register 3 Address. */
#define MC_CGM_AC0_DC3_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0814U))
/* CGM: Auxiliary Clock 0 Divider Configuration Register 4 Address. */
#define MC_CGM_AC0_DC4_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0818U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 0 Select Control Register Address. */
    #define MC_CGM_0_AC0_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0800U))
    /* CGM: Auxiliary Clock 0 Select Status Register Address. */
    #define MC_CGM_0_AC0_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0804U))
    /* CGM: Auxiliary Clock 0 Divider Configuration Register 0 Address. */
    #define MC_CGM_0_AC0_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0808U))
    
    /* CGM: Auxiliary Clock 0 Select Control Register Address. */
    #define MC_CGM_2_AC0_SC_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0800U))
    /* CGM: Auxiliary Clock 0 Select Status Register Address. */
    #define MC_CGM_2_AC0_SS_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0804U))
    /* CGM: Auxiliary Clock 0 Divider Configuration Register 0 Address. */
    #define MC_CGM_2_AC0_DC0_ADDR32                   ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0808U))
#endif

/***********************************************************/
/**********************    CGM_AC1    **********************/
/***********************************************************/

/* CGM: Auxiliary Clock 1 Select Control Register Address. */
#define MC_CGM_AC1_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0820U))

/* CGM: Auxiliary Clock 1 Select Status Register Address. */
#define MC_CGM_AC1_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0824U))

/* CGM: Auxiliary Clock 1 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC1_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0828U))
/* CGM: Auxiliary Clock 1 Divider1 Configuration Register 1 Address. */
#define MC_CGM_AC1_DC1_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x082CU))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 2 Select Control Register Address. */
    #define MC_CGM_0_AC1_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0820U))
    /* CGM: Auxiliary Clock 2 Select Status Register Address. */
    #define MC_CGM_0_AC1_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0824U))
    /* CGM: Auxiliary Clock 2 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC1_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0828U))
#endif
/***********************************************************/
/**********************    CGM_AC2    **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 2 Select Control Register Address. */
#define MC_CGM_AC2_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0840U))

/* CGM: Auxiliary Clock 2 Select Status Register Address. */
#define MC_CGM_AC2_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0844U))

/* CGM: Auxiliary Clock 2 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC2_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0848U))
/* CGM: Auxiliary Clock 2 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC2_DC1_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x084CU))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 2 Select Control Register Address. */
    #define MC_CGM_0_AC2_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0840U))
    /* CGM: Auxiliary Clock 2 Select Status Register Address. */
    #define MC_CGM_0_AC2_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0844U))
    /* CGM: Auxiliary Clock 2 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC2_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0848U))
    
    /* CGM: Auxiliary Clock 2 Select Control Register Address. */
    #define MC_CGM_2_AC2_SC_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0840U))
    /* CGM: Auxiliary Clock 2 Select Status Register Address. */
    #define MC_CGM_2_AC2_SS_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0844U))
    /* CGM: Auxiliary Clock 2 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_2_AC2_DC0_ADDR32                   ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0848U))
#endif

