marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_AC3    **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 3 Select Control Register Address. */
#define MC_CGM_AC3_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0860U))

/* CGM: Auxiliary Clock 3 Select Status Register Address. */
#define MC_CGM_AC3_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0864U))

/* CGM: Auxiliary Clock 3 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC3_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0868U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 3 Select Control Register Address. */
    #define MC_CGM_0_AC3_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0860U))
    /* CGM: Auxiliary Clock 3 Select Status Register Address. */
    #define MC_CGM_0_AC3_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0864U))
    /* CGM: Auxiliary Clock 3 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC3_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0868U))
    
    /* CGM: Auxiliary Clock 3 Select Control Register Address. */
    #define MC_CGM_2_AC3_SC_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0860U))
    /* CGM: Auxiliary Clock 3 Select Status Register Address. */
    #define MC_CGM_2_AC3_SS_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0864U))
    /* CGM: Auxiliary Clock 3 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_2_AC3_DC0_ADDR32                   ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0868U))
#endif

/***********************************************************/
/**********************    CGM_AC4    **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 4 Select Control Register Address. */
#define MC_CGM_AC4_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0880U))

/* CGM: Auxiliary Clock 4 Select Status Register Address. */
#define MC_CGM_AC4_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0884U))

/* CGM: Auxiliary Clock 4 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC4_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0888U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 4 Select Control Register Address. */
    #define MC_CGM_0_AC4_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0880U))
    /* CGM: Auxiliary Clock 4 Select Status Register Address. */
    #define MC_CGM_0_AC4_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0884U))
    /* CGM: Auxiliary Clock 4 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC4_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0888U))
    
    /* CGM: Auxiliary Clock 4 Select Control Register Address. */
    #define MC_CGM_2_AC4_SC_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0880U))
    /* CGM: Auxiliary Clock 4 Select Status Register Address. */
    #define MC_CGM_2_AC4_SS_ADDR32                    ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0884U))
    /* CGM: Auxiliary Clock 4 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_2_AC4_DC0_ADDR32                   ((uint32)(MC_CGM_2_BASEADDR + (uint32)0x0888U))
#endif

/***********************************************************/
/**********************    CGM_AC5    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_05_00_00_10) \
    )
    /* CGM: Auxiliary Clock 5 Select Control Register Address. */
    #define MC_CGM_AC5_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08A0U))

    /* CGM: Auxiliary Clock 5 Select Status Register Address. */
    #define MC_CGM_AC5_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08A4U))

    /* CGM: Auxiliary Clock 5 Divider0 Configuration Register Address. */
    #define MC_CGM_AC5_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x08A8U))
    /* CGM: Auxiliary Clock 5 Divider1 Configuration Register Address. */
    #define MC_CGM_AC5_DC1_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x08ACU))
    /* CGM: Auxiliary Clock 5 Divider0 Configuration Register Address. */
    #define MC_CGM_AC5_DC2_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x08B0U))

    /* Auxiliary Clock 5 Cascaded Divider 0 Configuration Register (MC_CGM_AC5_CDC0) */
    #define MC_CGM_AC5_CDC0_ADDR32                  ((uint32)(MC_CGM_BASEADDR + (uint32)0x0680U))
    /* Auxiliary Clock 5 Cascaded Divider 1 Configuration Register (MC_CGM_AC5_CDC1) */
    #define MC_CGM_AC5_CDC1_ADDR32                  ((uint32)(MC_CGM_BASEADDR + (uint32)0x0684U))
    /* Auxiliary Clock 5 Cascaded Divider 2 Configuration Register (MC_CGM_AC5_CDC2) */
    #define MC_CGM_AC5_CDC2_ADDR32                  ((uint32)(MC_CGM_BASEADDR + (uint32)0x0688U))
    /* Auxiliary Clock 5 Cascaded Divider 10 Configuration Register (MC_CGM_AC5_CDC10) */
    #define MC_CGM_AC5_CDC10_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x0690U))
    /* Auxiliary Clock 5 Cascaded Divider 11 Configuration Register (MC_CGM_AC5_CDC11) */
    #define MC_CGM_AC5_CDC11_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x0694U))
    /* Auxiliary Clock 5 Cascaded Divider 12 Configuration Register (MC_CGM_AC5_CDC12) */
    #define MC_CGM_AC5_CDC12_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x0698U))
    /* Auxiliary Clock 5 Cascaded Divider 13 Configuration Register (MC_CGM_AC5_CDC13) */
    #define MC_CGM_AC5_CDC13_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x069CU))
    /* Auxiliary Clock 5 Cascaded Divider 20 Configuration Register (MC_CGM_AC5_CDC20) */
    #define MC_CGM_AC5_CDC20_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x06A0U))
    /* Auxiliary Clock 5 Cascaded Divider 21 Configuration Register (MC_CGM_AC5_CDC21) */
    #define MC_CGM_AC5_CDC21_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x06A4U))
    /* Auxiliary Clock 5 Cascaded Divider 22 Configuration Register (MC_CGM_AC5_CDC22) */
    #define MC_CGM_AC5_CDC22_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x06A8U))
    /* Auxiliary Clock 5 Cascaded Divider 23 Configuration Register (MC_CGM_AC5_CDC23) */
    #define MC_CGM_AC5_CDC23_ADDR32                 ((uint32)(MC_CGM_BASEADDR + (uint32)0x06ACU))

#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM: Auxiliary Clock 5 Select Control Register Address. */
    #define MC_CGM_AC5_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x01C0U))
    /* CGM: Auxiliary Clock 5 Select Status Register Address. */
    #define MC_CGM_AC5_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x01C4U))
#endif


