marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 5 Select Control Register Address. */
    #define MC_CGM_0_AC5_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08A0U))
    /* CGM: Auxiliary Clock 5 Select Status Register Address. */
    #define MC_CGM_0_AC5_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08A4U))
    /* CGM: Auxiliary Clock 5 Divider0 Configuration Register Address. */
    #define MC_CGM_0_AC5_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08A8U))
    /* CGM: Auxiliary Clock 5 Divider1 Configuration Register Address. */
    #define MC_CGM_0_AC5_DC1_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08ACU))
#endif

/***********************************************************/
/**********************    CGM_AC6    **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 6 Select Control Register Address. */
#define MC_CGM_AC6_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08C0U))

/* CGM: Auxiliary Clock 6 Select Status Register Address. */
#define MC_CGM_AC6_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08C4U))

/* CGM: Auxiliary Clock 6 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC6_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x08C8U))
/* CGM: Auxiliary Clock 6 Divider0 Configuration Register 1 Address. */
#define MC_CGM_AC6_DC1_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x08CCU))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 6 Select Control Register Address. */
    #define MC_CGM_0_AC6_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08C0U))
    /* CGM: Auxiliary Clock 6 Select Status Register Address. */
    #define MC_CGM_0_AC6_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08C4U))
    /* CGM: Auxiliary Clock 6 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC6_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08C8U))
#endif

/***********************************************************/
/**********************    CGM_AC7    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_05_00_00_10) \
    )

    /* CGM: Auxiliary Clock 7 Select Control Register Address. */
    #define MC_CGM_AC7_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08E0U))

    /* CGM: Auxiliary Clock 7 Select Status Register Address. */
    #define MC_CGM_AC7_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08E4U))

    /* CGM: Auxiliary Clock 7 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_AC7_DC0_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08E8U))
    /* CGM: Auxiliary Clock 7 Divider0 Configuration Register 1 Address. */
    #define MC_CGM_AC7_DC1_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x08ECU))

#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 7 Select Control Register Address. */
    #define MC_CGM_0_AC7_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08E0U))
    /* CGM: Auxiliary Clock 7 Select Status Register Address. */
    #define MC_CGM_0_AC7_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08E4U))
    /* CGM: Auxiliary Clock 7 Divider0 Configuration Register 1 Address. */
    #define MC_CGM_0_AC7_DC1_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x08ECU))
#endif

/***********************************************************/
/**********************    CGM_AC8    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_05_00_00_10) \
    )

    /* CGM: Auxiliary Clock 8 Select Control Register Address. */
    #define MC_CGM_AC8_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0900U))

    /* CGM: Auxiliary Clock 8 Select Status Register Address. */
    #define MC_CGM_AC8_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0904U))

    /* CGM: Auxiliary Clock 8 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_AC8_DC0_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0908U))

#elif (IPV_MC == IPV_MC_05_00_00_07)

    /* CGM: Auxiliary Clock 8 Select Control Register Address. */
    #define MC_CGM_AC8_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0280U))

    /* CGM: Auxiliary Clock 8 Select Status Register Address. */
    #define MC_CGM_AC8_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0284U))

#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 8 Select Control Register Address. */
    #define MC_CGM_0_AC8_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0900U))
    /* CGM: Auxiliary Clock 8 Select Status Register Address. */
    #define MC_CGM_0_AC8_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0904U))
    /* CGM: Auxiliary Clock 8 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC8_DC0_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0908U))
    /* CGM: Auxiliary Clock 8 Divider1 Configuration Register 1 Address. */
    #define MC_CGM_0_AC8_DC1_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x090CU))
#endif
/***********************************************************/
/**********************    CGM_AC9    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_05_00_00_10) \
    )

    /* CGM: Auxiliary Clock 9 Select Control Register Address. */
    /* For IPV_MC_04_06_05_00 this address is intentionally wrong,
    just to differentiate AC9 from AC14 */
    #define MC_CGM_AC9_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0920U))

    /* CGM: Auxiliary Clock 9 Select Status Register Address. */
    #define MC_CGM_AC9_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0924U))

