marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
    /* CGM: Auxiliary Clock 9 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_AC9_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0928U))

#elif (IPV_MC == IPV_MC_05_00_00_07)

    /* CGM: Auxiliary Clock 9 Select Control Register Address. */
    #define MC_CGM_AC9_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x02C0U))

    /* CGM: Auxiliary Clock 9 Select Status Register Address. */
    #define MC_CGM_AC9_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x02C4U))

#endif

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 9 Select Control Register Address. */
    #define MC_CGM_0_AC9_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0920U))
    /* CGM: Auxiliary Clock 9 Select Status Register Address. */
    #define MC_CGM_0_AC9_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0924U))
    /* CGM: Auxiliary Clock 9 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC9_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0928U))
    /* CGM: Auxiliary Clock 9 Divider1 Configuration Register 1 Address. */
    #define MC_CGM_0_AC9_DC1_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x092CU))
#endif

/***********************************************************/
/**********************    CGM_AC10   **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 10 Select Control Register Address. */
#define MC_CGM_AC10_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0940U))

/* CGM: Auxiliary Clock 10 Select Status Register Address. */
#define MC_CGM_AC10_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0944U))

/* CGM: Auxiliary Clock 10 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC10_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x0948U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 10 Select Control Register Address. */
    #define MC_CGM_0_AC10_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0940U))
    /* CGM: Auxiliary Clock 10 Select Status Register Address. */
    #define MC_CGM_0_AC10_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0944U))
    /* CGM: Auxiliary Clock 10 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC10_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0948U))
    /* CGM: Auxiliary Clock 10 Divider1 Configuration Register 0 Address. */
    #define MC_CGM_0_AC10_DC1_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x094CU))
#endif

/***********************************************************/
/**********************    CGM_AC11   **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 11 Select Control Register Address. */
#define MC_CGM_AC11_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0960U))

/* CGM: Auxiliary Clock 11 Select Status Register Address. */
#define MC_CGM_AC11_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0964U))

/* CGM: Auxiliary Clock 11 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC11_DC0_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0968U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 11 Select Control Register Address. */
    #define MC_CGM_0_AC11_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0960U))
    /* CGM: Auxiliary Clock 11 Select Status Register Address. */
    #define MC_CGM_0_AC11_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0964U))
    /* CGM: Auxiliary Clock 11 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC11_DC0_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0968U))
#endif

/***********************************************************/
/**********************    CGM_AC12   **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 12 Select Control Register Address. */
#define MC_CGM_AC12_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0980U))

/* CGM: Auxiliary Clock 12 Select Status Register Address. */
#define MC_CGM_AC12_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0984U))

/* CGM: Auxiliary Clock 12 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC12_DC0_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x0988U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 12 Select Control Register Address. */
    #define MC_CGM_0_AC12_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0980U))
    /* CGM: Auxiliary Clock 12 Select Status Register Address. */
    #define MC_CGM_0_AC12_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0984U))
    /* CGM: Auxiliary Clock 12 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC12_DC0_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x0988U))
#endif

/***********************************************************/
/**********************    CGM_AC13   **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 13 Select Control Register Address. */
#define MC_CGM_AC13_SC_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x09A0U))

/* CGM: Auxiliary Clock 13 Select Status Register Address. */
#define MC_CGM_AC13_SS_ADDR32                    ((uint32)(MC_CGM_BASEADDR + (uint32)0x09A4U))

/* CGM: Auxiliary Clock 13 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC13_DC0_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x09A8U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 13 Select Control Register Address. */
    #define MC_CGM_0_AC13_SC_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09A0U))
    /* CGM: Auxiliary Clock 13 Select Status Register Address. */
    #define MC_CGM_0_AC13_SS_ADDR32                    ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09A4U))
    /* CGM: Auxiliary Clock 13 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC13_DC0_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09A8U))
#endif

