marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_AC14   **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 14 Select Control Register Address. */
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_04_01_00) ||\
     (IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) ||\
     (IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_04_06_05_00) \
    )
    #define MC_CGM_AC14_SC_ADDR32               ((uint32)((uint32)0xFFC10028U))
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_AC14_SC_ADDR32               ((uint32)(MC_CGM_BASEADDR + (uint32)0x09C0U))
#endif
/* CGM: Auxiliary Clock 14 Select Status Register Address. */
#define MC_CGM_AC14_SS_ADDR32                   ((uint32)(MC_CGM_BASEADDR + (uint32)0x09C4U))

/* CGM: Auxiliary Clock 14 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC14_DC0_ADDR32                  ((uint32)(MC_CGM_BASEADDR + (uint32)0x09C8U))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 14 Select Control Register Address. */
    #define MC_CGM_0_AC14_SC_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09C0U))
    /* CGM: Auxiliary Clock 14 Select Status Register Address. */
    #define MC_CGM_0_AC14_SS_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09C4U))
    /* CGM: Auxiliary Clock 14 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC14_DC0_ADDR32                  ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09C8U))
#endif

/***********************************************************/
/**********************    CGM_AC15   **********************/
/***********************************************************/
/* CGM: Auxiliary Clock 15 Select Control Register Address. */
#define MC_CGM_AC15_SC_ADDR32                   ((uint32)(MC_CGM_BASEADDR +(uint32)0x09E0U))

/* CGM: Auxiliary Clock 15 Select Status Register Address. */
#define MC_CGM_AC15_SS_ADDR32                   ((uint32)(MC_CGM_BASEADDR +(uint32)0x09E4U))

/* CGM: Auxiliary Clock 15 Divider0 Configuration Register 0 Address. */
#define MC_CGM_AC15_DC0_ADDR32                  ((uint32)(MC_CGM_BASEADDR + (uint32)0x09E8U))
/* CGM: Auxiliary Clock 15 Divider0 Configuration Register 1 Address. */
#define MC_CGM_AC15_DC1_ADDR32                  ((uint32)(MC_CGM_BASEADDR + (uint32)0x09ECU))

#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM: Auxiliary Clock 15 Select Control Register Address. */
    #define MC_CGM_0_AC15_SC_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR +(uint32)0x09E0U))
    /* CGM: Auxiliary Clock 15 Select Status Register Address. */
    #define MC_CGM_0_AC15_SS_ADDR32                   ((uint32)(MC_CGM_0_BASEADDR +(uint32)0x09E4U))
    /* CGM: Auxiliary Clock 15 Divider0 Configuration Register 0 Address. */
    #define MC_CGM_0_AC15_DC0_ADDR32                  ((uint32)(MC_CGM_0_BASEADDR + (uint32)0x09E8U))
#endif

/***************** MC_CGM Registers Masks ******************/
/***********************************************************/
/**********************    CGM_PCS    **********************/
/***********************************************************/
#define MC_CGM_PCS_DIVC_RWBITS_MASK32               ((uint32)0xFFFF00FFU)
#define MC_CGM_PCS_DIVC_RESBITS_MASK32              ((uint32)0x00000000U)
#define MC_CGM_PCS_DIVS_RWBITS_MASK32               ((uint32)0x000FFFFFU)
#define MC_CGM_PCS_DIVS_RESBITS_MASK32              ((uint32)0x00000000U)
#define MC_CGM_PCS_DIVE_RWBITS_MASK32               ((uint32)0x000FFFFFU)
#define MC_CGM_PCS_DIVE_RESBITS_MASK32              ((uint32)0x00000000U)

/* MC_CGM_PCS_DIVCn[INIT] field mask. */
#define MC_CGM_PCS_DIVC_INIT_U32_MASK32             ((uint32)0xFFFF0000U)

/* MC_CGM_PCS_DIVCn[RATE] field mask. */
#define MC_CGM_PCS_DIVC_RATE_U32_MASK32             ((uint32)0x000000FFU)

/* MC_CGM_DIVSn[DIVS] field mask. */
#define MC_CGM_PCS_DIVS_U32_RATE_MASK32             ((uint32)0x000FFFFFU)

/* MC_CGM_DIVEn[DIVE] field mask. */
#define MC_CGM_PCS_DIVE_U32_RATE_MASK32             ((uint32)0x000FFFFFU)


/***********************************************************/
/********************    MC_CGM_UPD     ********************/
/***********************************************************/

/* System Clock Divider Ratio Change Register (MC_CGM_SC_DIV_RC) */
#define MC_CGM_SC_DIV_RC_RWBITS_MASK32                  ((uint32)0x00000001U)
#define MC_CGM_SC_DIV_RC_RESBITS_MASK32                 ((uint32)0x00000000U)

/* MC_CGM_SC_DIV_RC[SYS_DIV_RATIO_CHNG] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_SC_DIV_RC_SYS_DIV_RATIO_CHNG_U32_MASK32  ((uint32)0x00000001U)


#if (IPV_MC == IPV_MC_04_06_01_00)
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000767U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)

#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* Divider Update Type (MC_CGM_DIV_UPD_TYPE) */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x8000FFFFU)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)

#elif (IPV_MC == IPV_MC_05_00_00_07)

    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)

    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000300U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)
    
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)
    
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_2_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_2_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)
    
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_3_DIV_UPD_TYPE_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_3_DIV_UPD_TYPE_RESBITS_MASK32              ((uint32)0x00000000U)
    
#endif

