marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/* MC_CGM_DIV_UPD_TYPE[SYS_UPD_TYPE] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_SYS_UPD_TYPE_U32_MASK32     ((uint32)0x80000000U)

/* MC_CGM_DIV_UPD_TYPE[AUX15 .. 0_UPD_TYPE] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX15_UPD_TYPE_U32_MASK32   ((uint32)0x00008000U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX14_UPD_TYPE_U32_MASK32   ((uint32)0x00004000U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX13_UPD_TYPE_U32_MASK32   ((uint32)0x00002000U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX12_UPD_TYPE_U32_MASK32   ((uint32)0x00001000U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX11_UPD_TYPE_U32_MASK32   ((uint32)0x00000800U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX10_UPD_TYPE_U32_MASK32   ((uint32)0x00000400U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX9_UPD_TYPE_U32_MASK32    ((uint32)0x00000200U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX8_UPD_TYPE_U32_MASK32    ((uint32)0x00000100U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX7_UPD_TYPE_U32_MASK32    ((uint32)0x00000080U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX6_UPD_TYPE_U32_MASK32    ((uint32)0x00000040U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX5_UPD_TYPE_U32_MASK32    ((uint32)0x00000020U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX4_UPD_TYPE_U32_MASK32    ((uint32)0x00000010U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX3_UPD_TYPE_U32_MASK32    ((uint32)0x00000008U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX2_UPD_TYPE_U32_MASK32    ((uint32)0x00000004U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX1_UPD_TYPE_U32_MASK32    ((uint32)0x00000002U)
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_TYPE_AUX0_UPD_TYPE_U32_MASK32    ((uint32)0x00000001U)


/* Divider Update Trigger (MC_CGM_DIV_UPD_TRIG) */
#define MC_CGM_DIV_UPD_TRIG_RWBITS_MASK32               ((uint32)0xFFFFFFFFU)
#define MC_CGM_DIV_UPD_TRIG_RESBITS_MASK32              ((uint32)0x00000000U)

#if (IPV_MC == IPV_MC_04_06_01_00)
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RWBITS_MASK32               ((uint32)0x80000767U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RESBITS_MASK32              ((uint32)0x00000000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RESBITS_MASK32              ((uint32)0x00000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)

    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RWBITS_MASK32               ((uint32)0x8000FFFFU)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RESBITS_MASK32              ((uint32)0x00000000U)

#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* Divider Update Status (MC_CGM_DIV_UPD_STAT) */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RWBITS_MASK32               ((uint32)0x80000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_DIV_UPD_STAT_RESBITS_MASK32              ((uint32)0x00000000U)

#endif

/* MC_CGM_DIV_UPD_STAT[SYS_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_SYS_UPD_TYPE_U32_MASK32     ((uint32)0x80000000U)
/* MC_CGM_DIV_UPD_STAT[AUX10_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX10_UPD_TYPE_U32_MASK32   ((uint32)0x00000400U)
/* MC_CGM_DIV_UPD_STAT[AUX9_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX9_UPD_TYPE_U32_MASK32    ((uint32)0x00000200U)
/* MC_CGM_DIV_UPD_STAT[AUX8_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX8_UPD_TYPE_U32_MASK32    ((uint32)0x00000100U)
/* MC_CGM_DIV_UPD_STAT[AUX6_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX6_UPD_TYPE_U32_MASK32    ((uint32)0x00000040U)
/* MC_CGM_DIV_UPD_STAT[AUX5_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX5_UPD_TYPE_U32_MASK32    ((uint32)0x00000020U)
/* MC_CGM_DIV_UPD_STAT[AUX2_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX2_UPD_TYPE_U32_MASK32    ((uint32)0x00000004U)
/* MC_CGM_DIV_UPD_STAT[AUX1_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX1_UPD_TYPE_U32_MASK32    ((uint32)0x00000002U)
/* MC_CGM_DIV_UPD_STAT[AUX0_UPD_STAT] field mask. */
/** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
#define MC_CGM_DIV_UPD_STAT_AUX0_UPD_TYPE_U32_MASK32    ((uint32)0x00000001U)


