marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_SC     **********************/
/***********************************************************/
/* CGM_SC_SS[SELSTAT] bits mask. */
#define MC_CGM_SC_SS_SELSTAT_MASK32                 ((uint32)0x0F000000U)
/* CGM_SC_SS[SWTRG] bits mask. */
#define MC_CGM_SC_SS_SWTRG_MASK32                   ((uint32)0x000E0000U)
/* CGM_SC_SS[SWIP] bits mask. */
#define MC_CGM_SC_SS_SWIP_MASK32                    ((uint32)0x00010000U)


#if (IPV_MC == IPV_MC_04_04_01_00)
    /* CGM_SC_DC0[DE] bit mask. */
    #define MC_CGM_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x000F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x001F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_DIV_RWBITS_MASK32         ((uint32)0x000F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC2_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC3[DIV] bits mask. */
    #define MC_CGM_SC_DC3_DIV_RWBITS_MASK32         ((uint32)0x000F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC3_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC4[DIV] bits mask. */
    #define MC_CGM_SC_DC4_DIV_RWBITS_MASK32         ((uint32)0x000F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC4_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
#elif (IPV_MC == IPV_MC_04_00_15_15)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC2_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC3[DIV] bits mask. */
    #define MC_CGM_SC_DC3_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC3_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC4[DIV] bits mask. */
    #define MC_CGM_SC_DC4_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC4_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
#elif (IPV_MC == IPV_MC_04_01_00_00)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_DIV_RWBITS_MASK32         ((uint32)0x003F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC2_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* MC_CGM_SC_DC0 bits mask. */
    #define MC_CGM_SC_DC0_RWBITS_MASK32             ((uint32)0x803F0000U)
    #define MC_CGM_SC_DC0_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_SC_DC0_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_DIV_U32_MASK32            ((uint32)0x003F0000U)

    /* MC_CGM_SC_DC1 bits mask. */
    #define MC_CGM_SC_DC1_RWBITS_MASK32             ((uint32)0x803F0000U)
    #define MC_CGM_SC_DC1_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC1[DE] bits mask. */
    #define MC_CGM_SC_DC1_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_DIV_U32_MASK32            ((uint32)0x003F0000U)

    /* MC_CGM_SC_DC2 bits mask. */
    #define MC_CGM_SC_DC2_RWBITS_MASK32             ((uint32)0x803F0000U)
    #define MC_CGM_SC_DC2_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC2[DE] bits mask. */
    #define MC_CGM_SC_DC2_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_DIV_U32_MASK32            ((uint32)0x003F0000U)

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_RWBITS_MASK32             ((uint32)0x800F0000U)
    #define MC_CGM_SC_DC0_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_SC_DC0_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_DIV_U32_MASK32            ((uint32)0x000F0000U)

    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_RWBITS_MASK32             ((uint32)0x80030000U)
    #define MC_CGM_SC_DC1_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC1[DE] bits mask. */
    #define MC_CGM_SC_DC1_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_DIV_U32_MASK32            ((uint32)0x00030000U)

    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_RWBITS_MASK32             ((uint32)0x80070000U)
    #define MC_CGM_SC_DC2_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC2[DE] bits mask. */
    #define MC_CGM_SC_DC2_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_DIV_U32_MASK32            ((uint32)0x00070000U)

    /* CGM_SC_DC3[DIV] bits mask. */
    #define MC_CGM_SC_DC3_RWBITS_MASK32             ((uint32)0x800F0000U)
    #define MC_CGM_SC_DC3_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC3[DE] bits mask. */
    #define MC_CGM_SC_DC3_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC3[DIV] bits mask. */
    #define MC_CGM_SC_DC3_DIV_U32_MASK32            ((uint32)0x000F0000U)

    /* CGM_SC_DC4[DIV] bits mask. */
    #define MC_CGM_SC_DC4_RWBITS_MASK32             ((uint32)0x801F0000U)
    #define MC_CGM_SC_DC4_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC4[DE] bits mask. */
    #define MC_CGM_SC_DC4_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC4[DIV] bits mask. */
    #define MC_CGM_SC_DC4_DIV_U32_MASK32            ((uint32)0x001F0000U)

