marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
    /* CGM_SC_DC5[DIV] bits mask. */
    #define MC_CGM_SC_DC5_RWBITS_MASK32             ((uint32)0x800F0000U)
    #define MC_CGM_SC_DC5_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_SC_DC5[DE] bits mask. */
    #define MC_CGM_SC_DC5_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC5[DIV] bits mask. */
    #define MC_CGM_SC_DC5_DIV_U32_MASK32            ((uint32)0x000F0000U)

    /* CGM_SC_DC6[DIV] bits mask. */
    #define MC_CGM_SC_DC6_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC6_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC6[DE] bits mask. */
    #define MC_CGM_SC_DC6_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC6[DIV] bits mask. */
    #define MC_CGM_SC_DC6_DIV_U32_MASK32            ((uint32)0x00030000U)

#elif (IPV_MC == IPV_MC_05_00_00_07)

    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x00070000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x80000000U)

    /* CGM_SC_DC1[DIV] bits mask. */
    #define MC_CGM_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x00070000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x80000000U)

    /* CGM_SC_DC2[DIV] bits mask. */
    #define MC_CGM_SC_DC2_DIV_RWBITS_MASK32         ((uint32)0x000F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC2_DIV_RESBITS_MASK32        ((uint32)0x80000000U)

    /* CGM_SC_DC3[DIV] bits mask. */
    #define MC_CGM_SC_DC3_DIV_RWBITS_MASK32         ((uint32)0x00000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC3_DIV_RESBITS_MASK32        ((uint32)0x80030000U)

    /* CGM_SC_DC4[DIV] bits mask. */
    #define MC_CGM_SC_DC4_DIV_RWBITS_MASK32         ((uint32)0x00000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC4_DIV_RESBITS_MASK32        ((uint32)0x80010000U)

    /* CGM_SC_DC5[DIV] bits mask. */
    #define MC_CGM_SC_DC5_DIV_RWBITS_MASK32         ((uint32)0x001F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC5_DIV_RESBITS_MASK32        ((uint32)0x80000000U)

    /* CGM_SC_DC6[DIV] bits mask. */
    #define MC_CGM_SC_DC6_DIV_RWBITS_MASK32         ((uint32)0x00000000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC6_DIV_RESBITS_MASK32        ((uint32)0x00000000U)

    /* CGM_SC_DC6[DE] bits mask. */
    #define MC_CGM_SC_DC6_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC6[DIV] bits mask. */
    #define MC_CGM_SC_DC6_DIV_U32_MASK32            ((uint32)0x00070000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

#if (IPV_MC == IPV_MC_04_06_05_00)
    /* CGM_SC_DC5[DIV] bits mask. */
    #define MC_CGM_SC_DC5_DIV_RWBITS_MASK32         ((uint32)0x001F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_SC_DC5_DIV_RESBITS_MASK32        ((uint32)0x80000000U)
#endif

#if (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_SC_DC0[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_0_SC_DC0_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_0_SC_DC0_DIV_U32_MASK32            ((uint32)0x00030000U)
    
    /* CGM_SC_DC1[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_0_SC_DC1_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_0_SC_DC1_DIV_U32_MASK32            ((uint32)0x00030000U)
    
    /* CGM_SC_DC2[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_SC_DC2_DIV_RWBITS_MASK32         ((uint32)0x80070000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_0_SC_DC2_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_0_SC_DC2_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_0_SC_DC2_DIV_U32_MASK32            ((uint32)0x00070000U)
    
    /* CGM_SC_DC0[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_1_SC_DC0_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_1_SC_DC0_DIV_U32_MASK32            ((uint32)0x00030000U)
    
    /* CGM_SC_DC1[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_1_SC_DC1_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_1_SC_DC1_DIV_U32_MASK32            ((uint32)0x00030000U)
    
    /* CGM_SC_DC2[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_SC_DC2_DIV_RWBITS_MASK32         ((uint32)0x800F0000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_1_SC_DC2_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_1_SC_DC2_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_1_SC_DC2_DIV_U32_MASK32            ((uint32)0x000F0000U)
       
    /* CGM_SC_DC0[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_2_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_2_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_2_SC_DC0_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_2_SC_DC0_DIV_U32_MASK32            ((uint32)0x00030000U)

    /* CGM_SC_DC0[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_3_SC_DC0_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_3_SC_DC0_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_3_SC_DC0_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_3_SC_DC0_DIV_U32_MASK32            ((uint32)0x00030000U)
      
    /* CGM_SC_DC1[DIV] bits mask. */
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_3_SC_DC1_DIV_RWBITS_MASK32         ((uint32)0x80030000U)
    /** @violates @ref REG_ESYS_MC_CGM_h_REF_1 MISRA 2004 Required Rule 1.4, 31 characters limit.*/
    #define MC_CGM_3_SC_DC1_DIV_RESBITS_MASK32        ((uint32)0x00000000U)
    /* CGM_SC_DC0[DE] bits mask. */
    #define MC_CGM_3_SC_DC1_DE_U32_MASK32             ((uint32)0x80000000U)
    /* CGM_SC_DC0[DIV] bits mask. */
    #define MC_CGM_3_SC_DC1_DIV_U32_MASK32            ((uint32)0x00030000U)
#endif

