marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************  CGM_CLKOUT1  **********************/
/***********************************************************/
/* CGM_CLKOUT1_SC[SELCTL] bits mask. */
#define MC_CGM_CLKOUT1_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
#define MC_CGM_CLKOUT1_SC_RESBITS_MASK32            ((uint32)0x00000000U)

/* MC_CGM_CLKOUT1_DC[DE] bit mask. */
#define MC_CGM_CLKOUT1_DC_DE_MASK32             ((uint32)0x80000000U)
/* MC_CGM_CLKOUT1_DC[DIV] bit mask. */
#define MC_CGM_CLKOUT1_DC_DIV_MASK32            ((uint32)0x07FF0000U)

/***********************************************************/
/**********************    CGM_AC0    **********************/
/***********************************************************/
#if (IPV_MC == IPV_MC_04_04_01_00)

    /* CGM_AC0_SC[SELCTL] bits mask. */
    #define MC_CGM_AC0_SC_SELCTL_MASK32             ((uint32)0x03000000U)
    
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))

    /* CGM_AC0_SC[SELCTL] bits mask. */
    #define MC_CGM_AC0_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
      
    /* CGM_AC0_SC[SELCTL] bits mask. */
    #define MC_CGM_AC0_SC_SELCTL_MASK32             ((uint32)0x0F000000U)

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* CGM_AC0_SC[SELCTL] bits mask. */
    #define MC_CGM_AC0_SC_SELCTL_MASK32             ((uint32)0x01000000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC0_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC0_SC_SELCTL_MASK32             ((uint32)0x07000000U)   
    
    /* CGM_AC0_SC[SELCTL] bits mask. */
    #define MC_CGM_2_AC0_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

#define MC_CGM_AC0_SC_RESBITS_MASK32                ((uint32)0x00000000U)

#if (IPV_MC == IPV_MC_04_04_01_00)
    #define MC_CGM_AC0_SS_SELSTAT_MASK32            ((uint32)0x03000000U)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_CGM_AC0_SS_SELSTAT_MASK32            ((uint32)0x07000000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    #define MC_CGM_AC0_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_AC0_SS_SELSTAT_MASK32            ((uint32)0x01000000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

/* CGM_AC0_DC0 bit mask. */
#define MC_CGM_AC0_DC0_DE_MASK32                    ((uint32)0x80000000U)
#define MC_CGM_AC0_DC0_DIV_MASK32                   ((uint32)0x000F0000U)

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* CGM_AC0_DC1 bit mask. */
    #define MC_CGM_AC0_DC1_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_AC0_DC1_DIV_MASK32                   ((uint32)0x007F0000U)

    /* CGM_AC0_DC2 bit mask. */
    #define MC_CGM_AC0_DC2_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_AC0_DC2_DIV_MASK32                   ((uint32)0x007F0000U)
#else
    /* CGM_AC0_DC1 bit mask. */
    #define MC_CGM_AC0_DC1_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_AC0_DC1_DIV_MASK32                   ((uint32)0x001F0000U)

    /* CGM_AC0_DC2 bit mask. */
    #define MC_CGM_AC0_DC2_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_AC0_DC2_DIV_MASK32                   ((uint32)0x001F0000U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

/* CGM_AC0_DC3 bit mask. */
#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))

    #define MC_CGM_AC0_DC3_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_AC0_DC3_DIV_MASK32                   ((uint32)0x01FF0000U)
    #define MC_CGM_AC0_DC3_DIV_FMT_MASK32               ((uint32)0x00000003U)

#elif (IPV_MC == IPV_MC_04_06_01_00)

    #define MC_CGM_AC0_DC3_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_AC0_DC3_DIV_MASK32                   ((uint32)0x1FFF0000U)
    #define MC_CGM_AC0_DC3_DIV_FMT_MASK32               ((uint32)0x00000003U)

#endif

/* CGM_AC0_DC4 bit mask. */
#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    #define MC_CGM_AC0_DC4_DE_MASK32                    ((uint32)0x80000000U)
#endif

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    #define MC_CGM_AC0_DC4_DIV_MASK32                   ((uint32)0x000F0000U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_CGM_AC0_DC4_DIV_MASK32                   ((uint32)0x003F0000U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

#if (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC0_DC1 bit mask. */
    #define MC_CGM_0_AC0_DC0_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_0_AC0_DC0_DIV_MASK32                   ((uint32)0x00030000U)
    
    /* CGM_AC0_DC1 bit mask. */
    #define MC_CGM_2_AC0_DC0_DE_MASK32                    ((uint32)0x80000000U)
    #define MC_CGM_2_AC0_DC0_DIV_MASK32                   ((uint32)0x000F0000U)

#endif

/***********************************************************/
/**********************    CGM_AC1    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC1_SC[SELCTL] bits mask. */
    #define MC_CGM_AC1_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC1_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC1_SS[SELCTL] bits mask. */
    #define MC_CGM_AC1_SS_SELCTL_MASK32             ((uint32)0x07000000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    /* CGM_AC1_SC[SELCTL] bits mask. */
    #define MC_CGM_AC1_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC1_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC1_SS[SELCTL] bits mask. */
    #define MC_CGM_AC1_SS_SELCTL_MASK32             ((uint32)0x0F000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC1_SC[SELCTL] bits mask. */
    #define MC_CGM_AC1_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC1_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC1_SS[SELCTL] bits mask. */
    #define MC_CGM_AC1_SS_SELCTL_MASK32             ((uint32)0x07000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM_AC1_SS[SELCTL] bits mask. */
    #define MC_CGM_AC1_SS_SELCTL_MASK32             ((uint32)0x03000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM_AC1_SS[SELCTL] bits mask. */
    #define MC_CGM_0_AC1_SC_SELCTL_MASK32             ((uint32)0x07000000U)
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */

#if ((IPV_MC == IPV_MC_04_00_15_15)|| (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* CGM_AC1_DC0 bit mask. */
    #define MC_CGM_AC1_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC1_DC0_DIV_MASK32               ((uint32)0x007F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_AC1_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC1_DC0_DIV_MASK32               ((uint32)0x1FFF0000U)
#else
    /* CGM_AC1_DC0 bit mask. */
    #define MC_CGM_AC1_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC1_DC0_DIV_MASK32               ((uint32)0x001F0000U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

/* CGM_AC1_DC1 bit mask. */
#if (IPV_MC == IPV_MC_04_04_01_00)
    #define MC_CGM_AC1_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC1_DC1_DIV_MASK32               ((uint32)0x003F0000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

