marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
#if (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM_AC1_DC0 bit mask. */
    #define MC_CGM_0_AC1_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC1_DC0_DIV_MASK32               ((uint32)0x00030000U)
#endif

/***********************************************************/
/**********************    CGM_AC2    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC2_SC[SELCTL] bits mask. */
    #define MC_CGM_AC2_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC2_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC2_SS[SELCTL] bits mask. */
    #define MC_CGM_AC2_SS_SELCTL_MASK32             ((uint32)0x07000000U)

#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* CGM_AC2_SC[SELCTL] bits mask. */
    #define MC_CGM_AC2_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC2_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC2_SS[SELCTL] bits mask. */
    #define MC_CGM_AC2_SS_SELCTL_MASK32             ((uint32)0x0F000000U)

#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC2_SC[SELCTL] bits mask. */
    #define MC_CGM_AC2_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC2_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC2_SS[SELCTL] bits mask. */
    #define MC_CGM_AC2_SS_SELCTL_MASK32             ((uint32)0x07000000U)

#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM_AC2_SC[SELCTL] bits mask. */
    #define MC_CGM_AC2_SC_SELCTL_MASK32             ((uint32)0x01000000U)
    #define MC_CGM_AC2_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC2_SS[SELCTL] bits mask. */
    #define MC_CGM_AC2_SS_SELCTL_MASK32             ((uint32)0x01000000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM_AC2_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC2_SC_SELCTL_MASK32             ((uint32)0x07000000U)

    /* CGM_AC2_SC[SELCTL] bits mask. */
    #define MC_CGM_2_AC2_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */

/* CGM_AC2_DC0 bit mask. */
#define MC_CGM_AC2_DC0_DE_MASK32                    ((uint32)0x80000000U)

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_05_00_00_10))
    #define MC_CGM_AC2_DC0_DIV_MASK32               ((uint32)0x000F0000U)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_CGM_AC2_DC0_DIV_MASK32               ((uint32)0x007F0000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    #define MC_CGM_AC2_DC0_DIV_MASK32               ((uint32)0x003F0000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

/* CGM_AC2_DC1 bit mask. */
#define MC_CGM_AC2_DC1_DE_MASK32                ((uint32)0x80000000U)
#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    #define MC_CGM_AC2_DC1_DIV_MASK32               ((uint32)0x003F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_AC2_DC1_DIV_MASK32               ((uint32)0x000F0000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

#if (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC2_DC0 bit mask. */
    #define MC_CGM_0_AC2_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC2_DC0_DIV_MASK32               ((uint32)0x00030000U)
    
    /* CGM_AC2_DC0 bit mask. */
    #define MC_CGM_2_AC2_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_2_AC2_DC0_DIV_MASK32               ((uint32)0x000F0000U)
    
#endif

/***********************************************************/
/**********************    CGM_AC3    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
     (IPV_MC == IPV_MC_04_06_01_00) \
    )
    /* CGM_AC3_SC[SELCTL] bits mask. */
    #define MC_CGM_AC3_SC_SELCTL_MASK32                 ((uint32)0x0F000000U)
    #define MC_CGM_AC3_SC_RESBITS_MASK32                ((uint32)0x00000000U)
    /* CGM_AC3_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC3_SS_SELSTAT_MASK32                ((uint32)0x0F000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC3_SC[SELCTL] bits mask. */
    #define MC_CGM_AC3_SC_SELCTL_MASK32                 ((uint32)0x07000000U)
    #define MC_CGM_AC3_SC_RESBITS_MASK32                ((uint32)0x00000000U)
    /* CGM_AC3_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC3_SS_SELSTAT_MASK32                ((uint32)0x07000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM_AC3_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC3_SC_SELCTL_MASK32                 ((uint32)0x0F000000U)
        
    /* CGM_AC3_SC[SELCTL] bits mask. */
    #define MC_CGM_2_AC3_SC_SELCTL_MASK32                 ((uint32)0x0F000000U)
#else
    /* CGM_AC3_SC[SELCTL] bits mask. */
    #define MC_CGM_AC3_SC_SELCTL_MASK32                 ((uint32)0x01000000U)
    #define MC_CGM_AC3_SC_RESBITS_MASK32                ((uint32)0x00000000U)
    /* CGM_AC3_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC3_SS_SELSTAT_MASK32                ((uint32)0x01000000U)
#endif 

/* CGM_AC3_DC1 bit mask. */
#define MC_CGM_AC3_DC0_DE_MASK32                ((uint32)0x80000000U)
#define MC_CGM_AC3_DC0_DIV_MASK32               ((uint32)0x000F0000U)

#if (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC3_DC0 bit mask. */
    #define MC_CGM_0_AC3_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC3_DC0_DIV_MASK32               ((uint32)0x00030000U)
    
    /* CGM_AC3_DC0 bit mask. */
    #define MC_CGM_2_AC3_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_2_AC3_DC0_DIV_MASK32               ((uint32)0x000F0000U)
    
#endif

/***********************************************************/
/**********************    CGM_AC4    **********************/
/***********************************************************/
#if (IPV_MC == IPV_MC_04_04_01_00)
    /* CGM_AC4_SC[SELCTL] bits mask. */
    #define MC_CGM_AC4_SC_SELCTL_MASK32             ((uint32)0x03000000U)
    /* CGM_AC4_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC4_SS_SELSTAT_MASK32            ((uint32)0x03000000U)
#elif ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) || \
       (IPV_MC == IPV_MC_05_00_00_07) \
      )
    /* CGM_AC4_SC[SELCTL] bits mask. */
    #define MC_CGM_AC4_SC_SELCTL_MASK32             ((uint32)0x01000000U)
    /* CGM_AC4_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC4_SS_SELSTAT_MASK32            ((uint32)0x01000000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    /* CGM_AC4_SC[SELCTL] bits mask. */
    #define MC_CGM_AC4_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    /* CGM_AC4_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC4_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC4_SC[SELCTL] bits mask. */
    #define MC_CGM_AC4_SC_SELCTL_MASK32                 ((uint32)0x07000000U)
    /* CGM_AC4_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC4_SS_SELSTAT_MASK32                ((uint32)0x07000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM_AC4_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC4_SC_SELCTL_MASK32                 ((uint32)0x0F000000U)
    /* CGM_AC4_SC[SELCTL] bits mask. */
    #define MC_CGM_2_AC4_SC_SELCTL_MASK32                 ((uint32)0x0F000000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

#define MC_CGM_AC4_SC_RESBITS_MASK32                ((uint32)0x00000000U)


/* CGM_AC4_DC1 bit mask. */
#define MC_CGM_AC4_DC0_DE_MASK32                ((uint32)0x80000000U)
#define MC_CGM_AC4_DC0_DIV_MASK32               ((uint32)0x000F0000U)

