marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
#if (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC4_DC0 bit mask. */
    #define MC_CGM_0_AC4_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC4_DC0_DIV_MASK32               ((uint32)0x000F0000U)

    /* CGM_AC4_DC0 bit mask. */
    #define MC_CGM_2_AC4_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_2_AC4_DC0_DIV_MASK32               ((uint32)0x000F0000U)
#endif

/***********************************************************/
/**********************    CGM_AC5    **********************/
/***********************************************************/
#if (IPV_MC == IPV_MC_04_04_01_00)
    /* CGM_AC5_SC[SELCTL] bits mask. */
    #define MC_CGM_AC5_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC5_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC5_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC5_SS_SELSTAT_MASK32            ((uint32)0x07000000U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* CGM_AC5_SC[SELCTL] bits mask. */
    #define MC_CGM_AC5_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC5_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC5_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC5_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC5_SC[SELCTL] bits mask. */
    #define MC_CGM_AC5_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC5_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC5_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC5_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM_AC5_SC[SELCTL] bits mask. */
    #define MC_CGM_AC5_SC_SELCTL_MASK32             ((uint32)0x01000000U)
    #define MC_CGM_AC5_SC_RESBITS_MASK32            ((uint32)0x00000000U)
    /* CGM_AC5_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC5_SS_SELSTAT_MASK32            ((uint32)0x01000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)
    /* CGM_AC5_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC5_SC_SELCTL_MASK32             ((uint32)0x03000000U)
#endif

/* CGM_AC5_DC0 bit mask. */
#define MC_CGM_AC5_DC0_DE_MASK32                    ((uint32)0x80000000U)

#if ((IPV_MC == IPV_MC_04_04_01_00) || (IPV_MC == IPV_MC_05_00_00_10))
    #define MC_CGM_AC5_DC0_DIV_MASK32               ((uint32)0x001F0000U)
#elif (IPV_MC == IPV_MC_04_03_00_00)
    #define MC_CGM_AC5_DC0_DIV_MASK32               ((uint32)0x000F0000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    #define MC_CGM_AC5_DC0_DIV_MASK32               ((uint32)0x1FFF0000U)
    #define MC_CGM_AC5_DC0_DIV_FMT_MASK32           ((uint32)0x00000003U)
#elif (IPV_MC == IPV_MC_04_06_01_00)
    #define MC_CGM_AC5_DC0_DIV_MASK32               ((uint32)0x003F0000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* CGM_AC5_DC1 bit mask. */
    #define MC_CGM_AC5_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC5_DC1_DIV_MASK32               ((uint32)0x00FF0000U)
    /* CGM_AC5_DC2 bit mask. */
    #define MC_CGM_AC5_DC2_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC5_DC2_DIV_MASK32               ((uint32)0x03FF0000U)

#elif ((IPV_MC == IPV_MC_04_06_01_00) || (IPV_MC == IPV_MC_05_00_00_10))
    /* CGM_AC5_DC1 bit mask. */
    #define MC_CGM_AC5_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC5_DC1_DIV_MASK32               ((uint32)0x003F0000U)
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */

#if ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* MC_CGM_AC5_CDC0 bit mask. */
    #define MC_CGM_AC5_CDC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC0_DIV_MASK32              ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC1 bit mask. */
    #define MC_CGM_AC5_CDC1_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC1_DIV_MASK32              ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC2 bit mask. */
    #define MC_CGM_AC5_CDC2_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC2_DIV_MASK32              ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC10 bit mask. */
    #define MC_CGM_AC5_CDC10_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC10_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC11 bit mask. */
    #define MC_CGM_AC5_CDC11_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC11_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC12 bit mask. */
    #define MC_CGM_AC5_CDC12_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC12_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC13 bit mask. */
    #define MC_CGM_AC5_CDC13_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC13_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC20 bit mask. */
    #define MC_CGM_AC5_CDC20_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC20_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC21 bit mask. */
    #define MC_CGM_AC5_CDC21_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC21_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC22 bit mask. */
    #define MC_CGM_AC5_CDC22_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC22_DIV_MASK32             ((uint32)0x03FF0000U)
    /* MC_CGM_AC5_CDC23 bit mask. */
    #define MC_CGM_AC5_CDC23_DE_MASK32              ((uint32)0x80000000U)
    #define MC_CGM_AC5_CDC23_DIV_MASK32             ((uint32)0x03FF0000U)
#endif /* (IPV_MC == IPV_MC_04_00_15_15) */

#if (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC5_DC0 bit mask. */
    #define MC_CGM_0_AC5_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC5_DC0_DIV_MASK32               ((uint32)0x00030000U)
    /* CGM_AC5_DC1 bit mask. */
    #define MC_CGM_0_AC5_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC5_DC1_DIV_MASK32               ((uint32)0x00030000U)
    
#endif

