marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_AC6    **********************/
/***********************************************************/
#if (IPV_MC == IPV_MC_04_04_01_00)
    /* CGM_AC6_SC[SELCTL] bits mask. */
    #define MC_CGM_AC6_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC6_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC6_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC6_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC6_DC0 bit mask. */
    #define MC_CGM_AC6_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC6_DC0_DIV_MASK32               ((uint32)0x007F0000U)

#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* CGM_AC6_SC[SELCTL] bits mask. */
    #define MC_CGM_AC6_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC6_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC6_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC6_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)

    /* CGM_AC6_DC0 bit mask. */
    #define MC_CGM_AC6_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC6_DC0_DIV_MASK32               ((uint32)0x01FF0000U)

#elif (IPV_MC == IPV_MC_04_06_01_00)
    /* CGM_AC6_SC[SELCTL] bits mask. */
    #define MC_CGM_AC6_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC6_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC6_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC6_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)

    /* CGM_AC6_DC0 bit mask. */
    #define MC_CGM_AC6_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC6_DC0_DIV_MASK32               ((uint32)0x003F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC6_SC[SELCTL] bits mask. */
    #define MC_CGM_AC6_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC6_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC6_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC6_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC6_DC0 bit mask. */
    #define MC_CGM_AC6_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC6_DC0_DIV_MASK32               ((uint32)0x000F0000U)

    /* CGM_AC6_DC1 bit mask. */
    #define MC_CGM_AC6_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC6_DC1_DIV_MASK32               ((uint32)0x000F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM_AC6_SC[SELCTL] bits mask. */
    #define MC_CGM_AC6_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC6_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC6_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC6_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)

    /* CGM_AC6_DC0 bit mask. */
    #define MC_CGM_AC6_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC6_DC0_DIV_MASK32               ((uint32)0x001F0000U)
    #define MC_CGM_AC6_DC0_RESBITS_MASK32           ((uint32)0x80000000U)
#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC6_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC6_SC_SELCTL_MASK32             ((uint32)0x03000000U)
    
    /* CGM_AC6_DC0 bit mask. */
    #define MC_CGM_0_AC6_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC6_DC0_DIV_MASK32               ((uint32)0x00030000U)
    
#endif /* (IPV_MC == IPV_MC_04_04_01_00) */



/***********************************************************/
/**********************    CGM_AC7    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC7_SC[SELCTL] bits mask. */
    #define MC_CGM_AC7_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC7_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC7_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC7_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC7_DC0 bit mask. */
    #define MC_CGM_AC7_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC7_DC0_DIV_MASK32               ((uint32)0x000F0000U)

#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00))
    /* CGM_AC7_SC[SELCTL] bits mask. */
    #define MC_CGM_AC7_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC7_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC7_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC7_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)

    /* CGM_AC7_DC0 bit mask. */
    #define MC_CGM_AC7_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC7_DC0_DIV_MASK32               ((uint32)0x01FF0000U)

#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC7_SC[SELCTL] bits mask. */
    #define MC_CGM_AC7_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC7_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC7_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC7_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC7_DC0 bit mask. */
    #define MC_CGM_AC7_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC7_DC0_DIV_MASK32               ((uint32)0x000F0000U)
    /* CGM_AC7_DC1 bit mask. */
    #define MC_CGM_AC7_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC7_DC1_DIV_MASK32               ((uint32)0x000F0000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC7_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC7_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    
    /* CGM_AC7_DC1 bit mask. */
    #define MC_CGM_0_AC7_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC7_DC1_DIV_MASK32               ((uint32)0x001F0000U)
    
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */


