marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_AC8    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC8_SC[SELCTL] bits mask. */
    #define MC_CGM_AC8_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC8_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC8_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC8_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC8_DC0 bit mask. */
    #define MC_CGM_AC8_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC8_DC0_DIV_MASK32               ((uint32)0x001F0000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    /* CGM_AC8_SC[SELCTL] bits mask. */
    #define MC_CGM_AC8_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC8_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC8_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC8_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)

    /* CGM_AC8_DC0 bit mask. */
    #define MC_CGM_AC8_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC8_DC0_DIV_MASK32               ((uint32)0x003F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC8_SC[SELCTL] bits mask. */
    #define MC_CGM_AC8_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC8_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC8_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC8_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC8_DC0 bit mask. */
    #define MC_CGM_AC8_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC8_DC0_DIV_MASK32               ((uint32)0x000F0000U)

#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM_AC8_SC[SELCTL] bits mask. */
    #define MC_CGM_AC8_SC_SELCTL_MASK32             ((uint32)0x01000000U)
    #define MC_CGM_AC8_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC8_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC8_SS_SELSTAT_MASK32            ((uint32)0x01000000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC8_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC8_SC_SELCTL_MASK32             ((uint32)0x07000000U)

    /* CGM_AC8_DC0 bit mask. */
    #define MC_CGM_0_AC8_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC8_DC0_DIV_MASK32               ((uint32)0x00030000U)
    
    /* CGM_AC8_DC1 bit mask. */
    #define MC_CGM_0_AC8_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC8_DC1_DIV_MASK32               ((uint32)0x000F0000U)
    
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */


/***********************************************************/
/**********************    CGM_AC9    **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC9_SC[SELCTL] bits mask. */
    #define MC_CGM_AC9_SC_SELCTL_MASK32             ((uint32)0x0000003CU)
    #define MC_CGM_AC9_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC9_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC9_SS_SELSTAT_MASK32            ((uint32)0x03000000U)

    /* CGM_AC9_DC0 bit mask. */
    #define MC_CGM_AC9_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC9_DC0_DIV_MASK32               ((uint32)0x007F0000U)
#elif ( 0 ) /* (IPV_MC == IPV_MC_04_06_05_00) but it does not work */
    /* CGM_AC9_SC[SELCTL] bits mask. */
    #define MC_CGM_AC9_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC9_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC9_DC0 bit mask. */
    #define MC_CGM_AC9_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC9_DC0_DIV_MASK32               ((uint32)0x007F0000U)
#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    /* CGM_AC9_SC[SELCTL] bits mask. */
    #define MC_CGM_AC9_SC_SELCTL_MASK32             ((uint32)0x0F000000U)
    #define MC_CGM_AC9_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC9_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC9_SS_SELSTAT_MASK32            ((uint32)0x0F000000U)

    /* CGM_AC9_DC0 bit mask. */
    #define MC_CGM_AC9_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC9_DC0_DIV_MASK32               ((uint32)0x003F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC9_SC[SELCTL] bits mask. */
    #define MC_CGM_AC9_SC_SELCTL_MASK32             ((uint32)0x07000000U)
    #define MC_CGM_AC9_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC9_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC9_SS_SELSTAT_MASK32            ((uint32)0x07000000U)

    /* CGM_AC9_DC0 bit mask. */
    #define MC_CGM_AC9_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_AC9_DC0_DIV_MASK32               ((uint32)0x000F0000U)

#elif (IPV_MC == IPV_MC_05_00_00_07)
    /* CGM_AC9_SC[SELCTL] bits mask. */
    #define MC_CGM_AC9_SC_SELCTL_MASK32             ((uint32)0x01000000U)
    #define MC_CGM_AC9_SC_RESBITS_MASK32            ((uint32)0x00000000U)

    /* CGM_AC9_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC9_SS_SELSTAT_MASK32            ((uint32)0x01000000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC9_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC9_SC_SELCTL_MASK32             ((uint32)0x07000000U)

    /* CGM_AC9_DC0 bit mask. */
    #define MC_CGM_0_AC9_DC0_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC9_DC0_DIV_MASK32               ((uint32)0x00070000U)
    
    /* CGM_AC9_DC1 bit mask. */
    #define MC_CGM_0_AC9_DC1_DE_MASK32                ((uint32)0x80000000U)
    #define MC_CGM_0_AC9_DC1_DIV_MASK32               ((uint32)0x00070000U)
    
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */


