marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_AC10   **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_04_04_01_00) \
    )
    /* CGM_AC10_SC[SELCTL] bits mask. */
    #define MC_CGM_AC10_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC10_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC10_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC10_SS_SELSTAT_MASK32           ((uint32)0x07000000U)

    /* CGM_AC10_DC0 bit mask. */
    #define MC_CGM_AC10_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC10_DC0_DIV_MASK32              ((uint32)0x000F0000U)

#elif ((IPV_MC == IPV_MC_04_00_15_15) || (IPV_MC == IPV_MC_04_01_00_00) || \
       (IPV_MC == IPV_MC_04_06_01_00) \
      )
    /* CGM_AC10_SC[SELCTL] bits mask. */
    #define MC_CGM_AC10_SC_SELCTL_MASK32            ((uint32)0x0F000000U)
    #define MC_CGM_AC10_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC10_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC10_SS_SELSTAT_MASK32           ((uint32)0x0F000000U)

    /* CGM_AC10_DC0 bit mask. */
    #define MC_CGM_AC10_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC10_DC0_DIV_MASK32              ((uint32)0x000F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC10_SC[SELCTL] bits mask. */
    #define MC_CGM_AC10_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC10_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC10_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC10_SS_SELSTAT_MASK32           ((uint32)0x07000000U)

    /* CGM_AC10_DC0 bit mask. */
    #define MC_CGM_AC10_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC10_DC0_DIV_MASK32              ((uint32)0x000F0000U)
    
#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC10_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC10_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    
    /* CGM_AC10_DC0 bit mask. */
    #define MC_CGM_0_AC10_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC10_DC0_DIV_MASK32              ((uint32)0x000F0000U)
    #define MC_CGM_0_AC10_DC0_DIV_FMT_MASK32          ((uint32)0x00000003U)
    
    /* CGM_AC10_DC1 bit mask. */
    #define MC_CGM_0_AC10_DC1_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC10_DC1_DIV_MASK32              ((uint32)0x000F0000U)
    
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */


/***********************************************************/
/**********************    CGM_AC11   **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00) ||\
     (IPV_MC == IPV_MC_05_00_00_10) || (IPV_MC == IPV_MC_04_04_01_00) \
    )
    /* CGM_AC11_SC[SELCTL] bits mask. */
    #define MC_CGM_AC11_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC11_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC11_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC11_SS_SELSTAT_MASK32           ((uint32)0x07000000U)

    /* CGM_AC11_DC0 bit mask. */
    #define MC_CGM_AC11_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_AC11_DC0_DIV_MASK32              ((uint32)0x000F0000U)
    
#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC11_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC11_SC_SELCTL_MASK32            ((uint32)0x01000000U)
    
    /* CGM_AC11_DC0 bit mask. */
    #define MC_CGM_0_AC11_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC11_DC0_DIV_MASK32              ((uint32)0x00030000U)
    
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */


/***********************************************************/
/**********************    CGM_AC12   **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC12_SC[SELCTL] bits mask. */
    #define MC_CGM_AC12_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC12_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC12_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC12_SS_SELSTAT_MASK32           ((uint32)0x07000000U)

#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* CGM_AC12_SC[SELCTL] bits mask. */
    #define MC_CGM_AC12_SC_SELCTL_MASK32            ((uint32)0x0F000000U)
    #define MC_CGM_AC12_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC12_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC12_SS_SELSTAT_MASK32           ((uint32)0x0F000000U)

#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC12_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC12_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    
    /* CGM_AC12_DC0 bit mask. */
    #define MC_CGM_0_AC12_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC12_DC0_DIV_MASK32              ((uint32)0x00030000U)

#endif /* (IPV_MC == IPV_MC_04_03_00_00) */

/* CGM_AC12_DC0 bit mask. */
#define MC_CGM_AC12_DC0_DE_MASK32               ((uint32)0x80000000U)

#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_05_00_00_10))
    #define MC_CGM_AC12_DC0_DIV_MASK32              ((uint32)0x000F0000U)
#endif
#if (IPV_MC == IPV_MC_04_06_05_00)
    #define MC_CGM_AC12_DC0_DIV_MASK32              ((uint32)0x007F0000U)
#endif


/***********************************************************/
/**********************    CGM_AC13   **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    /* CGM_AC13_SC[SELCTL] bits mask. */
    #define MC_CGM_AC13_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC13_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC13_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC13_SS_SELSTAT_MASK32           ((uint32)0x07000000U)


#elif (IPV_MC == IPV_MC_05_00_00_10)
    /* CGM_AC13_SC[SELCTL] bits mask. */
    #define MC_CGM_AC13_SC_SELCTL_MASK32            ((uint32)0x0F000000U)
    #define MC_CGM_AC13_SC_RESBITS_MASK32           ((uint32)0x00000000U)

    /* CGM_AC13_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC13_SS_SELSTAT_MASK32           ((uint32)0x0F000000U)
    
#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC13_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC13_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    
    /* CGM_AC13_DC0 bit mask. */
    #define MC_CGM_0_AC13_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC13_DC0_DIV_MASK32              ((uint32)0x00030000U)
    
#endif /* (IPV_MC == IPV_MC_04_03_00_00) */

/* CGM_AC13_DC0 bit mask. */
#define MC_CGM_AC13_DC0_DE_MASK32               ((uint32)0x80000000U)

#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_05_00_00_10))
    #define MC_CGM_AC13_DC0_DIV_MASK32              ((uint32)0x000F0000U)
#elif (IPV_MC == IPV_MC_04_06_05_00)
    #define MC_CGM_AC13_DC0_DIV_MASK32              ((uint32)0x007F0000U)
#endif


