marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Mcu_TS_T2D35M10I0R0/include/Reg_eSys_MC_CGM.h
/***********************************************************/
/**********************    CGM_AC14   **********************/
/***********************************************************/
#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))

    /* CGM_AC14_SC[SELCTL] bits mask. */
    #define MC_CGM_AC14_SC_SELCTL_MASK32            ((uint32)0x000003C0U)
    #define MC_CGM_AC14_SC_RESBITS_MASK32           ((uint32)0x00000000U)
    /* CGM_AC14_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC14_SS_SELSTAT_MASK32           ((uint32)0x03000000U)
    
#elif (IPV_MC == IPV_MC_05_00_00_10)

    #define MC_CGM_AC14_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC14_SC_RESBITS_MASK32           ((uint32)0x00000000U)
    /* CGM_AC14_SS[SELSTAT] bit mask. */
    #define MC_CGM_AC14_SS_SELSTAT_MASK32           ((uint32)0x07000000U)
    
#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC14_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC14_SC_SELCTL_MASK32            ((uint32)0x07000000U)

    /* CGM_AC14_DC0 bit mask. */
    #define MC_CGM_0_AC14_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC14_DC0_DIV_MASK32              ((uint32)0x000F0000U)
    
#endif

/* CGM_AC14_DC0 bit mask. */
#define MC_CGM_AC14_DC0_DE_MASK32               ((uint32)0x80000000U)

#if ((IPV_MC == IPV_MC_04_03_00_00) || (IPV_MC == IPV_MC_04_06_05_00))
    #define MC_CGM_AC14_DC0_DIV_MASK32              ((uint32)0x007F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_AC14_DC0_DIV_MASK32              ((uint32)0x000F0000U)
#endif

#if (IPV_MC == IPV_MC_04_06_05_00)
    #define MCB_CGM_SINK_SEL_MASK32                   ((uint32)0x00FFF000U)
#endif

/***********************************************************/
/**********************    CGM_AC15   **********************/
/***********************************************************/
#if (IPV_MC == IPV_MC_04_06_05_00)

    /* CGM_AC15_SC[SELCTL] bits mask. */
    #define MC_CGM_AC15_SC_SELCTL_MASK32            ((uint32)0x0F000000U)
    #define MC_CGM_AC15_SC_RESBITS_MASK32           ((uint32)0x00000000U)
    
#elif (IPV_MC == IPV_MC_05_00_00_10)

    /* CGM_AC15_SC[SELCTL] bits mask. */
    #define MC_CGM_AC15_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    #define MC_CGM_AC15_SC_RESBITS_MASK32           ((uint32)0x00000000U)
    
#elif (IPV_MC == IPV_MC_06_00_00_10)

    /* CGM_AC15_SC[SELCTL] bits mask. */
    #define MC_CGM_0_AC15_SC_SELCTL_MASK32            ((uint32)0x07000000U)
    
    /* CGM_AC15_DC0 bit mask. */
    #define MC_CGM_0_AC15_DC0_DE_MASK32               ((uint32)0x80000000U)
    #define MC_CGM_0_AC15_DC0_DIV_MASK32              ((uint32)0x000F0000U)
    
#endif

/* CGM_AC15_DC0 bit mask. */
#define MC_CGM_AC15_DC0_DE_MASK32               ((uint32)0x80000000U)

#if (IPV_MC == IPV_MC_04_06_05_00)
    #define MC_CGM_AC15_DC0_DIV_MASK32              ((uint32)0x007F0000U)
#elif (IPV_MC == IPV_MC_05_00_00_10)
    #define MC_CGM_AC15_DC0_DIV_MASK32              ((uint32)0x000F0000U)
#endif

/* CGM_AC15_DC1 bit mask. */
#define MC_CGM_AC15_DC1_DE_MASK32               ((uint32)0x80000000U)
#define MC_CGM_AC15_DC1_DIV_MASK32              ((uint32)0x000F0000U)

#if (IPV_MC == IPV_MC_06_00_00_10)
    #define SRC_GPR1_VIDEO_PLL_SOURCE_SELECT_MASK32         ((uint32)0x80000000U)
    #define SRC_GPR1_PERIPH_PLL_SOURCE_SELECT_MASK32        ((uint32)0x40000000U)
    #define SRC_GPR1_DDR_PLL_SOURCE_SELECT_MASK32           ((uint32)0x20000000U)
    #define SRC_GPR1_ENET_PLL_SOURCE_SELECT_MASK32          ((uint32)0x10000000U)
    #define SRC_GPR1_ARM_PLL_SOURCE_SELECT_MASK32           ((uint32)0x08000000U)
#endif

/*==================================================================================================
*                                             ENUMS
==================================================================================================*/


/*==================================================================================================
*                                STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/


/*==================================================================================================
*                                GLOBAL VARIABLE DECLARATIONS
==================================================================================================*/


/*==================================================================================================
*                                    FUNCTION PROTOTYPES
==================================================================================================*/


#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_MC_CGM_H */

/** @} */
